[default]
cron_schedule = */30 * * * *
dispatch.earliest_time = 0
dispatch.latest_time = now
enableSched = 0
schedule_window = auto
[AWS EKS Cluster Created or Deleted]
description = Identifies when an EKS cluster is created or deleted.
search = index=cloudtrail _index_earliest=-1h@h eventSource="eks.amazonaws.com" eventName IN ("CreateCluster", "DeleteCluster") | fields - _raw | collect index=notable_events source="AWS EKS Cluster Created or Deleted" marker="guid=33d50d03-20ec-4b74-a74e-1e65a38af1c0,tags=attack.impact,tags=attack.t1485,"
[AWS Route 53 Domain Transfer Lock Disabled]
description = Detects when a transfer lock was removed from a Route 53 domain. It is recommended to refrain from performing this action unless intending to transfer the domain to a different registrar.
search = index=cloudtrail _index_earliest=-1h@h eventSource="route53.amazonaws.com" eventName="DisableDomainTransferLock" | fields - _raw | collect index=notable_events source="AWS Route 53 Domain Transfer Lock Disabled" marker="guid=3940b5f1-3f46-44aa-b746-ebe615b879e0,tags=attack.persistence,tags=attack.credential-access,tags=attack.t1098,"
[AWS S3 Bucket Versioning Disable]
description = Detects when S3 bucket versioning is disabled. Threat actors use this technique during AWS ransomware incidents prior to deleting S3 objects.
search = index=cloudtrail _index_earliest=-1h@h eventSource="s3.amazonaws.com" eventName="PutBucketVersioning" requestParameters="*Suspended*" | fields - _raw | collect index=notable_events source="AWS S3 Bucket Versioning Disable" marker="guid=a136ac98-b2bc-4189-a14d-f0d0388e57a7,tags=attack.impact,tags=attack.t1490,"
[SES Identity Has Been Deleted]
description = Detects an instance of an SES identity being deleted via the "DeleteIdentity" event. This may be an indicator of an adversary removing the account that carried out suspicious or malicious activities
search = index=cloudtrail _index_earliest=-1h@h eventSource="ses.amazonaws.com" eventName="DeleteIdentity" | fields - _raw | collect index=notable_events source="SES Identity Has Been Deleted" marker="guid=20f754db-d025-4a8f-9d74-e0037e999a9a,tags=attack.defense-evasion,tags=attack.t1070,"
[RDS Database Security Group Modification]
description = Detects changes to the security group entries for RDS databases. This can indicate that a misconfiguration has occurred which potentially exposes the database to the public internet, a wider audience within the VPC or that removal of valid rules has occurred which could impact the availability of the database to legitimate services and users. 
search = index=cloudtrail _index_earliest=-1h@h eventSource="rds.amazonaws.com" eventName IN ("AuthorizeDBSecurityGroupIngress", "CreateDBSecurityGroup", "DeleteDBSecurityGroup", "RevokeDBSecurityGroupIngress") | fields - _raw | collect index=notable_events source="RDS Database Security Group Modification" marker="guid=14f3f1c8-02d5-43a2-a191-91ffb52d3015,tags=attack.initial-access,tags=attack.t1190,"
[AWS Console GetSigninToken Potential Abuse]
description = Detects potentially suspicious events involving "GetSigninToken". An adversary using the "aws_consoler" tool can leverage this console API to create temporary federated credential that help obfuscate which AWS credential is compromised (the original access key) and enables the adversary to pivot from the AWS CLI to console sessions without the need for MFA using the new access key issued in this request. 
search = index=cloudtrail _index_earliest=-1h@h eventSource="signin.amazonaws.com" eventName="GetSigninToken" NOT userAgent="*Jersey/${project.version}*" | fields - _raw | collect index=notable_events source="AWS Console GetSigninToken Potential Abuse" marker="guid=f8103686-e3e8-46f3-be72-65f7fcb4aa53,tags=attack.lateral-movement,tags=attack.t1021.007,tags=attack.t1550.001,"
[AWS Glue Development Endpoint Activity]
description = Detects possible suspicious glue development endpoint activity.
search = index=cloudtrail _index_earliest=-1h@h eventSource="glue.amazonaws.com" eventName IN ("CreateDevEndpoint", "DeleteDevEndpoint", "UpdateDevEndpoint") | fields - _raw | collect index=notable_events source="AWS Glue Development Endpoint Activity" marker="guid=4990c2e3-f4b8-45e3-bc3c-30b14ff0ed26,tags=attack.privilege-escalation,"
[AWS RDS Master Password Change]
description = Detects the change of database master password. It may be a part of data exfiltration.
search = index=cloudtrail _index_earliest=-1h@h eventSource="rds.amazonaws.com" responseElements.pendingModifiedValues.masterUserPassword="*" eventName="ModifyDBInstance" | fields - _raw | collect index=notable_events source="AWS RDS Master Password Change" marker="guid=8a63cdd4-6207-414a-85bc-7e032bd3c1a2,tags=attack.exfiltration,tags=attack.t1020,"
[AWS GuardDuty Important Change]
description = Detects updates of the GuardDuty list of trusted IPs, perhaps to disable security alerts against malicious IPs.
search = index=cloudtrail _index_earliest=-1h@h eventSource="guardduty.amazonaws.com" eventName="CreateIPSet" | fields - _raw | collect index=notable_events source="AWS GuardDuty Important Change" marker="guid=6e61ee20-ce00-4f8d-8aee-bedd8216f7e3,tags=attack.defense-evasion,tags=attack.t1562.001,"
[AWS STS AssumeRole Misuse]
description = Identifies the suspicious use of AssumeRole. Attackers could move laterally and escalate privileges.
search = index=cloudtrail _index_earliest=-1h@h userIdentity.type="AssumedRole" userIdentity.sessionContext.sessionIssuer.type="Role" | fields - _raw | collect index=notable_events source="AWS STS AssumeRole Misuse" marker="guid=905d389b-b853-46d0-9d3d-dea0d3a3cd49,tags=attack.lateral-movement,tags=attack.privilege-escalation,tags=attack.t1548,tags=attack.t1550,tags=attack.t1550.001,"
[AWS S3 Data Management Tampering]
description = Detects when a user tampers with S3 data management in Amazon Web Services.
search = index=cloudtrail _index_earliest=-1h@h eventSource="s3.amazonaws.com" eventName IN ("PutBucketLogging", "PutBucketWebsite", "PutEncryptionConfiguration", "PutLifecycleConfiguration", "PutReplicationConfiguration", "ReplicateObject", "RestoreObject") | fields - _raw | collect index=notable_events source="AWS S3 Data Management Tampering" marker="guid=78b3756a-7804-4ef7-8555-7b9024a02e2d,tags=attack.exfiltration,tags=attack.t1537,"
[Ingress/Egress Security Group Modification]
description = Detects when an account makes changes to the ingress or egress rules of a security group. This can indicate that an attacker is attempting to open up new attack vectors in the account, that they are trying to exfiltrate data over the network, or that they are trying to allow machines in that VPC/Subnet to contact a C&C server. 
search = index=cloudtrail _index_earliest=-1h@h eventSource="ec2.amazonaws.com" eventName IN ("AuthorizeSecurityGroupEgress", "AuthorizeSecurityGroupIngress", "RevokeSecurityGroupEgress", "RevokeSecurityGroupIngress") | fields - _raw | collect index=notable_events source="Ingress/Egress Security Group Modification" marker="guid=6fb77778-040f-4015-9440-572aa9b6b580,tags=attack.initial-access,tags=attack.t1190,"
[AWS EC2 Startup Shell Script Change]
description = Detects changes to the EC2 instance startup script. The shell script will be executed as root/SYSTEM every time the specific instances are booted up.
search = index=cloudtrail _index_earliest=-1h@h eventSource="ec2.amazonaws.com" requestParameters.attribute="userData" eventName="ModifyInstanceAttribute" | fields - _raw | collect index=notable_events source="AWS EC2 Startup Shell Script Change" marker="guid=1ab3c5ed-5baf-417b-bb6b-78ca33f6c3df,tags=attack.execution,tags=attack.t1059.001,tags=attack.t1059.003,tags=attack.t1059.004,"
[AWS EC2 VM Export Failure]
description = An attempt to export an AWS EC2 instance has been detected. A VM Export might indicate an attempt to extract information from an instance.
search = index=cloudtrail _index_earliest=-1h@h eventName="CreateInstanceExportTask" eventSource="ec2.amazonaws.com" NOT (errorMessage="*" OR errorCode="*" OR responseElements="*Failure*") | fields - _raw | collect index=notable_events source="AWS EC2 VM Export Failure" marker="guid=54b9a76a-3c71-4673-b4b3-2edb4566ea7b,tags=attack.collection,tags=attack.t1005,tags=attack.exfiltration,tags=attack.t1537,"
[AWS IAM S3Browser Templated S3 Bucket Policy Creation]
description = Detects S3 browser utility creating Inline IAM policy containing default S3 bucket name placeholder value of "<YOUR-BUCKET-NAME>".
search = index=cloudtrail _index_earliest=-1h@h eventSource="iam.amazonaws.com" eventName="PutUserPolicy" userAgent="*S3 Browser*" requestParameters="*\"arn:aws:s3:::<YOUR-BUCKET-NAME>/*\"*" requestParameters="*\"s3:GetObject\"*" requestParameters="*\"Allow\"*" | fields - _raw | collect index=notable_events source="AWS IAM S3Browser Templated S3 Bucket Policy Creation" marker="guid=db014773-7375-4f4e-b83b-133337c0ffee,tags=attack.execution,tags=attack.t1059.009,tags=attack.persistence,tags=attack.t1078.004,"
[AWS EFS Fileshare Mount Modified or Deleted]
description = Detects when a EFS Fileshare Mount is modified or deleted. An adversary breaking any file system using the mount target that is being deleted, which might disrupt instances or applications using those mounts.
search = index=cloudtrail _index_earliest=-1h@h eventSource="elasticfilesystem.amazonaws.com" eventName="DeleteMountTarget" | fields - _raw | collect index=notable_events source="AWS EFS Fileshare Mount Modified or Deleted" marker="guid=6a7ba45c-63d8-473e-9736-2eaabff79964,tags=attack.impact,tags=attack.t1485,"
[AWS ElastiCache Security Group Modified or Deleted]
description = Identifies when an ElastiCache security group has been modified or deleted.
search = index=cloudtrail _index_earliest=-1h@h eventSource="elasticache.amazonaws.com" eventName IN ("DeleteCacheSecurityGroup", "AuthorizeCacheSecurityGroupIngress", "RevokeCacheSecurityGroupIngress", "AuthorizeCacheSecurityGroupEgress", "RevokeCacheSecurityGroupEgress") | fields - _raw | collect index=notable_events source="AWS ElastiCache Security Group Modified or Deleted" marker="guid=7c797da2-9cf2-4523-ba64-33b06339f0cc,tags=attack.impact,tags=attack.t1531,"
[AWS CloudTrail Important Change]
description = Detects disabling, deleting and updating of a Trail
search = index=cloudtrail _index_earliest=-1h@h eventSource="cloudtrail.amazonaws.com" eventName IN ("StopLogging", "UpdateTrail", "DeleteTrail") | fields - _raw | collect index=notable_events source="AWS CloudTrail Important Change" marker="guid=4db60cc0-36fb-42b7-9b58-a5b53019fb74,tags=attack.defense-evasion,tags=attack.t1562.001,"
[Malicious Usage Of IMDS Credentials Outside Of AWS Infrastructure]
description = Detects when an instance identity has taken an action that isn't inside SSM. This can indicate that a compromised EC2 instance is being used as a pivot point. 
search = index=cloudtrail _index_earliest=-1h@h NOT (eventSource="ssm.amazonaws.com" OR eventName="RegisterManagedInstance" OR sourceIPAddress="AWS Internal")\
| regex userIdentity.arn=".+:assumed-role/aws:.+" | fields - _raw | collect index=notable_events source="Malicious Usage Of IMDS Credentials Outside Of AWS Infrastructure" marker="guid=352a918a-34d8-4882-8470-44830c507aa3,tags=attack.privilege-escalation,tags=attack.defense-evasion,tags=attack.t1078,tags=attack.t1078.002,"
[AWS STS GetSessionToken Misuse]
description = Identifies the suspicious use of GetSessionToken. Tokens could be created and used by attackers to move laterally and escalate privileges.
search = index=cloudtrail _index_earliest=-1h@h eventSource="sts.amazonaws.com" eventName="GetSessionToken" userIdentity.type="IAMUser" | fields - _raw | collect index=notable_events source="AWS STS GetSessionToken Misuse" marker="guid=b45ab1d2-712f-4f01-a751-df3826969807,tags=attack.lateral-movement,tags=attack.privilege-escalation,tags=attack.t1548,tags=attack.t1550,tags=attack.t1550.001,"
[Potential Bucket Enumeration on AWS]
description = Looks for potential enumeration of AWS buckets via ListBuckets.
search = index=cloudtrail _index_earliest=-1h@h eventSource="s3.amazonaws.com" eventName="ListBuckets" NOT userIdentity.type="AssumedRole" | fields - _raw | collect index=notable_events source="Potential Bucket Enumeration on AWS" marker="guid=f305fd62-beca-47da-ad95-7690a0620084,tags=attack.discovery,tags=attack.t1580,"
[AWS Snapshot Backup Exfiltration]
description = Detects the modification of an EC2 snapshot's permissions to enable access from another account
search = index=cloudtrail _index_earliest=-1h@h eventSource="ec2.amazonaws.com" eventName="ModifySnapshotAttribute" | fields - _raw | collect index=notable_events source="AWS Snapshot Backup Exfiltration" marker="guid=abae8fec-57bd-4f87-aff6-6e3db989843d,tags=attack.exfiltration,tags=attack.t1537,"
[Potential Malicious Usage of CloudTrail System Manager]
description = Detect when System Manager successfully executes commands against an instance. 
search = index=cloudtrail _index_earliest=-1h@h eventName="SendCommand" eventSource="ssm.amazonaws.com" responseElements.command.status="Success" | fields - _raw | collect index=notable_events source="Potential Malicious Usage of CloudTrail System Manager" marker="guid=38e7f511-3f74-41d4-836e-f57dfa18eead,tags=attack.privilege-escalation,tags=attack.t1566,tags=attack.t1566.002,"
[AWS EFS Fileshare Modified or Deleted]
description = Detects when a EFS Fileshare is modified or deleted. You can't delete a file system that is in use. If the file system has any mount targets, the adversary must first delete them, so deletion of a mount will occur before deletion of a fileshare. 
search = index=cloudtrail _index_earliest=-1h@h eventSource="elasticfilesystem.amazonaws.com" eventName="DeleteFileSystem" | fields - _raw | collect index=notable_events source="AWS EFS Fileshare Modified or Deleted" marker="guid=25cb1ba1-8a19-4a23-a198-d252664c8cef,tags=attack.impact,"
[AWS Config Disabling Channel/Recorder]
description = Detects AWS Config Service disabling
search = index=cloudtrail _index_earliest=-1h@h eventSource="config.amazonaws.com" eventName IN ("DeleteDeliveryChannel", "StopConfigurationRecorder") | fields - _raw | collect index=notable_events source="AWS Config Disabling Channel/Recorder" marker="guid=07330162-dba1-4746-8121-a9647d49d297,tags=attack.defense-evasion,tags=attack.t1562.001,"
[Restore Public AWS RDS Instance]
description = Detects the recovery of a new public database instance from a snapshot. It may be a part of data exfiltration.
search = index=cloudtrail _index_earliest=-1h@h eventSource="rds.amazonaws.com" responseElements.publiclyAccessible="true" eventName="RestoreDBInstanceFromDBSnapshot" | fields - _raw | collect index=notable_events source="Restore Public AWS RDS Instance" marker="guid=c3f265c7-ff03-4056-8ab2-d486227b4599,tags=attack.exfiltration,tags=attack.t1020,"
[AWS SecurityHub Findings Evasion]
description = Detects the modification of the findings on SecurityHub.
search = index=cloudtrail _index_earliest=-1h@h eventSource="securityhub.amazonaws.com" eventName IN ("BatchUpdateFindings", "DeleteInsight", "UpdateFindings", "UpdateInsight") | table sourceIPAddress,userIdentity.arn | fields - _raw | collect index=notable_events source="AWS SecurityHub Findings Evasion" marker="guid=a607e1fe-74bf-4440-a3ec-b059b9103157,tags=attack.defense-evasion,tags=attack.t1562,"
[LoadBalancer Security Group Modification]
description = Detects changes to the security groups associated with an Elastic Load Balancer (ELB) or Application Load Balancer (ALB). This can indicate that a misconfiguration allowing more traffic into the system than required, or could indicate that an attacker is attempting to enable new connections into a VPC or subnet controlled by the account. 
search = index=cloudtrail _index_earliest=-1h@h eventSource="elasticloadbalancing.amazonaws.com" eventName IN ("ApplySecurityGroupsToLoadBalancer", "SetSecurityGroups") | fields - _raw | collect index=notable_events source="LoadBalancer Security Group Modification" marker="guid=7a4409fc-f8ca-45f6-8006-127d779eaad9,tags=attack.initial-access,tags=attack.t1190,"
[AWS IAM Backdoor Users Keys]
description = Detects AWS API key creation for a user by another user. Backdoored users can be used to obtain persistence in the AWS environment. Also with this alert, you can detect a flow of AWS keys in your org. 
search = index=cloudtrail _index_earliest=-1h@h eventSource="iam.amazonaws.com" eventName="CreateAccessKey" NOT userIdentity.arn="*responseElements.accessKey.userName*" | table userIdentity.arn,responseElements.accessKey.userName,errorCode,errorMessage | fields - _raw | collect index=notable_events source="AWS IAM Backdoor Users Keys" marker="guid=0a5177f4-6ca9-44c2-aacf-d3f3d8b6e4d2,tags=attack.persistence,tags=attack.t1098,"
[AWS IAM S3Browser LoginProfile Creation]
description = Detects S3 Browser utility performing reconnaissance looking for existing IAM Users without a LoginProfile defined then (when found) creating a LoginProfile.
search = index=cloudtrail _index_earliest=-1h@h eventSource="iam.amazonaws.com" eventName IN ("GetLoginProfile", "CreateLoginProfile") userAgent="*S3 Browser*" | fields - _raw | collect index=notable_events source="AWS IAM S3Browser LoginProfile Creation" marker="guid=db014773-b1d3-46bd-ba26-133337c0ffee,tags=attack.execution,tags=attack.persistence,tags=attack.t1059.009,tags=attack.t1078.004,"
[AWS Attached Malicious Lambda Layer]
description = Detects when an user attached a Lambda layer to an existing function to override a library that is in use by the function, where their malicious code could utilize the function's IAM role for AWS API calls. This would give an adversary access to the privileges associated with the Lambda service role that is attached to that function. 
search = index=cloudtrail _index_earliest=-1h@h eventSource="lambda.amazonaws.com" eventName="UpdateFunctionConfiguration*" | fields - _raw | collect index=notable_events source="AWS Attached Malicious Lambda Layer" marker="guid=97fbabf8-8e1b-47a2-b7d5-a418d2b95e3d,tags=attack.privilege-escalation,"
[AWS Root Credentials]
description = Detects AWS root account usage
search = index=cloudtrail _index_earliest=-1h@h userIdentity.type="Root" NOT eventType="AwsServiceEvent" | fields - _raw | collect index=notable_events source="AWS Root Credentials" marker="guid=8ad1600d-e9dc-4251-b0ee-a65268f29add,tags=attack.privilege-escalation,tags=attack.t1078.004,"
[AWS EC2 Disable EBS Encryption]
description = Identifies disabling of default Amazon Elastic Block Store (EBS) encryption in the current region. Disabling default encryption does not change the encryption status of your existing volumes. 
search = index=cloudtrail _index_earliest=-1h@h eventSource="ec2.amazonaws.com" eventName="DisableEbsEncryptionByDefault" | fields - _raw | collect index=notable_events source="AWS EC2 Disable EBS Encryption" marker="guid=16124c2d-e40b-4fcc-8f2c-5ab7870a2223,tags=attack.impact,tags=attack.t1486,tags=attack.t1565,"
[AWS ElastiCache Security Group Created]
description = Detects when an ElastiCache security group has been created.
search = index=cloudtrail _index_earliest=-1h@h eventSource="elasticache.amazonaws.com" eventName="CreateCacheSecurityGroup" | fields - _raw | collect index=notable_events source="AWS ElastiCache Security Group Created" marker="guid=4ae68615-866f-4304-b24b-ba048dfa5ca7,tags=attack.persistence,tags=attack.t1136,tags=attack.t1136.003,"
[New Network Route Added]
description = Detects the addition of a new network route to a route table in AWS. 
search = index=cloudtrail _index_earliest=-1h@h eventSource="ec2.amazonaws.com" eventName="CreateRoute" | fields - _raw | collect index=notable_events source="New Network Route Added" marker="guid=c803b2ce-c4a2-4836-beae-b112010390b1,tags=attack.initial-access,tags=attack.t1190,"
[AWS Route 53 Domain Transferred to Another Account]
description = Detects when a request has been made to transfer a Route 53 domain to another AWS account.
search = index=cloudtrail _index_earliest=-1h@h eventSource="route53.amazonaws.com" eventName="TransferDomainToAnotherAwsAccount" | fields - _raw | collect index=notable_events source="AWS Route 53 Domain Transferred to Another Account" marker="guid=b056de1a-6e6e-4e40-a67e-97c9808cf41b,tags=attack.persistence,tags=attack.credential-access,tags=attack.t1098,"
[AWS Suspicious SAML Activity]
description = Identifies when suspicious SAML activity has occurred in AWS. An adversary could gain backdoor access via SAML.
search = index=cloudtrail _index_earliest=-1h@h (eventSource="sts.amazonaws.com" eventName="AssumeRoleWithSAML") OR (eventSource="iam.amazonaws.com" eventName="UpdateSAMLProvider") | fields - _raw | collect index=notable_events source="AWS Suspicious SAML Activity" marker="guid=f43f5d2f-3f2a-4cc8-b1af-81fde7dbaf0e,tags=attack.initial-access,tags=attack.t1078,tags=attack.lateral-movement,tags=attack.t1548,tags=attack.privilege-escalation,tags=attack.t1550,tags=attack.t1550.001,"
[AWS Identity Center Identity Provider Change]
description = Detects a change in the AWS Identity Center (FKA AWS SSO) identity provider. A change in identity provider allows an attacker to establish persistent access or escalate privileges via user impersonation. 
search = index=cloudtrail _index_earliest=-1h@h eventSource IN ("sso-directory.amazonaws.com", "sso.amazonaws.com") eventName IN ("AssociateDirectory", "DisableExternalIdPConfigurationForDirectory", "DisassociateDirectory", "EnableExternalIdPConfigurationForDirectory") | fields - _raw | collect index=notable_events source="AWS Identity Center Identity Provider Change" marker="guid=d3adb3ef-b7e7-4003-9092-1924c797db35,tags=attack.persistence,tags=attack.t1556,"
[AWS ECS Task Definition That Queries The Credential Endpoint]
description = Detects when an Elastic Container Service (ECS) Task Definition includes a command to query the credential endpoint. This can indicate a potential adversary adding a backdoor to establish persistence or escalate privileges. 
search = index=cloudtrail _index_earliest=-1h@h eventSource="ecs.amazonaws.com" eventName IN ("DescribeTaskDefinition", "RegisterTaskDefinition", "RunTask") requestParameters.containerDefinitions.command="*$AWS_CONTAINER_CREDENTIALS_RELATIVE_URI*" | fields - _raw | collect index=notable_events source="AWS ECS Task Definition That Queries The Credential Endpoint" marker="guid=b94bf91e-c2bf-4047-9c43-c6810f43baad,tags=attack.persistence,tags=attack.t1525,"
[New Network ACL Entry Added]
description = Detects that network ACL entries have been added to a route table which could indicate that new attack vectors have been opened up in the AWS account. 
search = index=cloudtrail _index_earliest=-1h@h eventSource="ec2.amazonaws.com" eventName="CreateNetworkAclEntry" | fields - _raw | collect index=notable_events source="New Network ACL Entry Added" marker="guid=e1f7febb-7b94-4234-b5c6-00fb8500f5dd,tags=attack.initial-access,tags=attack.t1190,"
[AWS IAM S3Browser User or AccessKey Creation]
description = Detects S3 Browser utility creating IAM User or AccessKey.
search = index=cloudtrail _index_earliest=-1h@h eventSource="iam.amazonaws.com" eventName IN ("CreateUser", "CreateAccessKey") userAgent="*S3 Browser*" | fields - _raw | collect index=notable_events source="AWS IAM S3Browser User or AccessKey Creation" marker="guid=db014773-d9d9-4792-91e5-133337c0ffee,tags=attack.execution,tags=attack.persistence,tags=attack.t1059.009,tags=attack.t1078.004,"
